/****************************************************************************
Задача 3_4.

Дан отсортированный массив различных целых чисел A[0..n-1] и
массив целых чисел B[0..m-1]. Для каждого элемента массива B[i]
найдите минимальный индекс элемента массива A[k], ближайшего по
значению к B[i]. Время работы поиска для каждого элемента B[i]:
O(log(k)).
n ≤ 110000, m ≤ 1000.

 in          | out
-------------|-----------
 3           | 0 0 2
 10 20 30    |
 3           |
 9 15 35     |

 in          | out
-------------|-----------
 3           | 0 0 0 2
 10 20 30    |        
 4           |        
 8 9 10 32   |        

****************************************************************************/

#include <iostream>

int main()
{
    return 0;
}

