/****************************************************************************
Задача 2_3.

Даны два строго возрастающих массива целых чисел A[0..n) и
B[0..m) и число k. Найти количество таких пар индексов (i, j), что
A[i] + B[j] = k. Время работы O(n + m). n, m ≤ 100000.

*Указание.* Обходите массив B от конца к началу.

  in             | out
  ---------------|-----
  4              | 3
  -5 0 3 18      | 
  5              | 
  -10 -2 4 7 12  | 
  7              | 

****************************************************************************/

#include <iostream>

int main()
{
    return 0;
}

