/****************************************************************************
Во всех вариантах данной задачи необходимо реализовать
и использовать **сортировку вставками**.
****************************************************************************/

/****************************************************************************
Задача 1_2. Ломаная 1.

Задано N точек на плоскости. Указать (N-1)-звенную несамопересекающуюся
незамкнутую ломаную, проходящую через все эти точки.

*Указание*: стройте ломаную в порядке возрастания x-координаты. Если имеются
две точки с одинаковой x-координатой, то расположите раньше ту точку, у которой
y-координата меньше.

in  | out
--- | ---
4   | 0 0
0 0 | 0 1
1 1 | 1 0
1 0 | 1 1
0 1 |

****************************************************************************/

#include <iostream>

int main()
{
    return 0;
}

