/****************************************************************************
Во всех вариантах данной задачи необходимо реализовать и использовать **сортировку вставками**.
****************************************************************************/

/****************************************************************************
Задача 1_4. Строки.

Напишите программу, печатающую набор строк в лексикографическом порядке.

Строки разделяются символом перевода строки '\n'. Если последний символ в потоке ввода '\n', считать, что после него нет пустой строки. Максимальная длина строки 255 символов. Написать свою функцию сравнения строк.

in   | out
---- | ---
4    | ab
caba | aba
abba | abba
ab   | caba
aba  |

****************************************************************************/

#include <iostream>

int main()
{
    return 0;
}

