/****************************************************************************
Во всех задачах данного раздела необходимо реализовать и использовать
**локальную пирамидальную сортировку** (без использования дополнительной
памяти). Общее время работы алгоритма O(n log n).
****************************************************************************/

/****************************************************************************
Задача 2_4. Закраска прямой 2.

На числовой прямой окрасили N отрезков. Известны координаты левого и правого
концов каждого отрезка (Li и Ri). Найти сумму длин частей числовой прямой,
окрашенных ровно в один слой.

in  | out
--- | ---
3   | 3
1 4 |
7 8 |
2 5 |

****************************************************************************/

#include <iostream>

int main()
{
    return 0;
}

