/****************************************************************************
Во всех задачах данного раздела необходимо реализовать и использовать
**локальную пирамидальную сортировку** (без использования дополнительной
памяти). Общее время работы алгоритма O(n log n).
****************************************************************************/

/****************************************************************************
Задача 2_2. Современники.

Группа людей называется современниками если был такой момент, когда они могли
собраться вместе. Для этого в этот момент каждому из них должно было уже
исполниться 18 лет, но ещё не исполниться 80 лет.

Дан список Жизни Великих Людей. Необходимо получить максимальное количество
современников. В день 18летия человек уже может принимать участие в собраниях,
а в день 80летия и в день смерти уже не может.

Замечание. Человек мог не дожить до 18-летия, либо умереть в день 18-летия.
В этих случаях принимать участие в собраниях он не мог.

in                  | out
------------------- | ---
3                   | 3
2 5 1980 13 11 2055 |
1 1 1982 1 1 2030   |
2 1 1920 2 1 2000   |

****************************************************************************/

#include <iostream>

int main()
{
    return 0;
}

