/****************************************************************************
 Задача 4_1. Первые k элементов длинной последовательности.

Дана очень длинная последовательность целых чисел длины n. Требуется вывести
в отсортированном виде её первые k элементов. Последовательность может не
помещаться в память. Время работы O(n * log(k)). Доп. память O(k).
Использовать слияние.

in                 | out
------------------ | ---
9 4                | 1 2 3 4
3 7 4 5 6 1 15 4 2 |

****************************************************************************/

#include <iostream>

int main()
{
    return 0;
}

