/****************************************************************************
Во всех вариантах данной задачи необходимо реализовать
и использовать **сортировку вставками**.
****************************************************************************/

/****************************************************************************
Задача 1_3. Ломаная 2.

Аналогично 1.2, но ломаная должна быть замкнутая. Предполагается, что никакие
три точки не лежат на одной прямой.

Указание: стройте ломаную от точки, имеющей наименьшую координату x. Если таких
точек несколько, то используйте точку с наименьшей координатой y.

Точки на ломаной расположите в порядке убывания углов лучей от начальной точки
до всех остальных точек.

in  | out
--- | ---
4   | 0 0
0 0 | 0 1
1 1 | 1 1
1 0 | 1 0
0 1 |

****************************************************************************/

#include <iostream>

int main()
{
    return 0;
}

