/****************************************************************************
Задача 6_1. Соревнование

**Быстрейшая сортировка.**

Дан массив целых чисел в диапазоне [0..10^9]. Размер массива кратен 10
и ограничен сверху значением 2.5 * 10^6 элементов. Все значения массива
являются элементами псевдо-рандомной последовательности. Необходимо
отсортировать элементы массива за минимальное время и вывести каждый
**десятый** элемент отсортированной последовательности.

Реализуйте сортировку, основанную на QuickSort.

Минимальный набор оптимизаций, который необходимо реализовать:

1. Оптимизация ввода/вывода

2. Оптимизация выбора опорного элемента

3. Оптимизация Partition

4. Написать без рекурсии

5. Оптимизация концевой рекурсии

Задача обязательная.

За первое место в сдвоенной группе + 15 баллов.

За второе место + 10 баллов.

За третье место + 5 баллов.

in                   | out
-------------------- | ---
3 0 2 1 5 4 21 4 6 5 | 21

****************************************************************************/

#include <iostream>

int main()
{
    return 0;
}

