/****************************************************************************
Во всех задачах данного раздела необходимо реализовать и использовать
**локальную пирамидальную сортировку** (без использования дополнительной
памяти). Общее время работы алгоритма O(n log n).
****************************************************************************/

/****************************************************************************
Задача 2_3. Закраска прямой 1.

На числовой прямой окрасили N отрезков. Известны координаты левого и правого
концов каждого отрезка (Li и Ri). Найти длину окрашенной части числовой прямой.

in  | out
--- | ---
3   | 5
1 4 |
7 8 |
2 5 |

****************************************************************************/

#include <iostream>

int main()
{
    return 0;
}

