/****************************************************************************
Во всех вариантах данной задачи необходимо реализовать
и использовать **сортировку вставками**.
****************************************************************************/

/****************************************************************************
Задача 1_1. Ящики.

На склад привезли много пустых ящиков. Все ящики пронумерованы по порядку
поступления от 0. Известно, что их все можно сложить один в один (то есть так,
что каждый следующий помещается в предыдущий). Один ящик можно вложить в другой,
если его можно перевернуть так, что размеры одного ящика по всем осям станут
строго меньше размеров другого ящика по соответствующим осям. Требуется
определить, в какой последовательности они будут вложены друг в друга.
Вывести номера ящиков.

in      | out
------- | ---
3       | 1 0 2
2 3 5   |
1 1 1   |
10 4 10 |

****************************************************************************/

#include <iostream>

int main()
{
    return 0;
}

