/****************************************************************************
Жадные алгоритмы

**Заявки на переговоры.**

В большой IT-фирме есть только одна переговорная комната. Желающие
посовещаться заполняют заявки с желаемым временем начала и конца. Ваша
задача определить максимальное количество заявок, которое может быть
удовлетворено.

Число заявок ≤ 100000.

*Формат входных данных:*

Вход содержит только пары целых чисел --- начала и концы заявок.

*Формат выходных данных:*

Выход должен содержать натуральное число --- максимальное число заявок.

+------+-----+
| in   | out |
+------+-----+
| 1 2  | 5   |
| 2 5  |     |
| 7 10 |     |
| 2 3  |     |
| 6 7  |     |
| 4 7  |     |
| 3 6  |     |
| 3 5  |     |
| 1 2  |     |
| 4 5  |     |
+------+-----+
****************************************************************************/


#include <iostream>

int main()
{
    return 0;
}

