/****************************************************************************
Задача № 3. ДП (3 балла)

Дано N кубиков. Требуется определить каким количеством способов можно
выстроить из этих кубиков пирамиду.

*Формат входных данных:*
На вход подается количество кубиков N.

*Формат выходных данных:*
Вывести число различных пирамид из N кубиков.

****************************************************************************/

/****************************************************************************
Широкая пирамида.

Каждый вышележащий слой пирамиды должен быть строго меньше нижележащего.
N ≤ 300.

  ----+-----
  in  | out
  ----+-----
  3   | 2
  5   | 3
  7   | 5
  ----+-----

****************************************************************************/

#include <iostream>

int main()
{
    return 0;
}
