/****************************************************************************
Задача 3_2. Порядковые статистики.

Дано число N и N строк. Каждая строка содержащит команду добавления или
удаления натуральных чисел, а также запрос на получение k-ой порядковой
статистики. Команда добавления числа A задается положительным числом A,
команда удаления числа A задается отрицательным числом "-A".
Запрос на получение k-ой порядковой статистики задается числом k.
Требуемая скорость выполнения запроса - O(log n).

  in    | out
  ----- | ---
  5     | 40
  40 0  | 40
  10 1  | 10
  4 1   | 4
  -10 0 | 50
  50 2  |

****************************************************************************/

#include <iostream>

int main()
{
    return 0;
}

