/****************************************************************************
Дано число N &lt; 10^6 и последовательность целых чисел из [-2^31..2^31]
длиной N. Требуется построить бинарное дерево, заданное наивным порядком
вставки. Т.е., при добавлении очередного числа K в дерево с корнем root, если
root→Key ≤ K, то узел K добавляется в правое поддерево root; иначе в левое
поддерево root.
****************************************************************************/

/****************************************************************************

Задача 1_3 Выведите элементы в порядке post-order (снизу вверх).

  in    | out
  ----- | ---
  3     |
  2 1 3 | 1 3 2

  in    | out
  ----- | ---
  3     |
  1 2 3 | 3 2 1

  in    | out
  ----- | ---
  3     |
  3 1 2 | 2 1 3

****************************************************************************/

#include <iostream>

int main()
{
    return 0;
}

