/****************************************************************************
Задача 3_1.

Дан отсортированный массив целых чисел A[0..n-1] и массив
целых чисел B[0..m-1]. Для каждого элемента массива B[i] найдите
минимальный индекс k минимального элемента массива A, равного или
превосходящего B[i]: A[k] >= B[i]. Если такого элемента нет,
выведите n. Время работы поиска k для каждого элемента B[i]: O(log(k)).
n, m ≤ 10000.

*Формат входных данных.*
В первой строчке записаны числа n и m. Во второй и третьей массивы A и B
соответственно.

  in       | out
  ---------|-------
  2 1      | 1
  1 2      |
  2        | 

  in       | out
  ---------|-------
  4 3      | 1 3 0
  2 4 5 7  | 
  4 6 1    | 

****************************************************************************/

#include <iostream>

int main()
{
    return 0;
}

