//
// Решение предполагает использование кучи.
//

/****************************************************************************
Задача 6_1. Жадина.

Вовочка ест фрукты из бабушкиной корзины. В корзине лежат фрукты разной
массы. Вовочка может поднять не более K грамм. Каждый фрукт весит не
более K грамм. За раз он выбирает несколько самых тяжелых фруктов,
которые может поднять одновременно, откусывает от каждого половину и
кладет огрызки обратно в корзину. Если фрукт весит нечетное число грамм,
он откусывает большую половину. Фрукт массы 1гр он съедает полностью.
Определить за сколько подходов Вовочка съест все фрукты в корзине.

*Формат входных данных.* Вначале вводится n - количество фруктов и n
строк с массами фруктов. n ≤ 50000. Затем K - "грузоподъемность". K ≤ 1000.

*Формат выходных данных.* Неотрицательное число - количество подходов к
корзине.

  in             | out
  ---------------|-----
  3              | 4
  1 2 2          | 
  2              | 

  in             | out
  ---------------|-----
  3              | 5
  4 3 5          | 
  6              | 

  in             | out
  ---------------|-----
  7              | 3
  1 1 1 1 1 1 1  | 
  3              | 

****************************************************************************/

#include <iostream>

int main()
{
    return 0;
}

