//
// Решение предполагает использование стека.
// Способ реализации стека может быть любым (список/динамический массив).
//

/****************************************************************************

Задача 5_2. Стековые анаграммы

Пара слов называется стековой анаграмой, если одно слово можно получить
из другого, проведя последовательность стековых операций с его буквами
(взять очередную букву исходного слова и поместить ее в стек; взять
букву из стека и добавить ее в конец выходного слова).

Для заданной пары слов требуется определить, можно ли выполнить
последовательность стековых операций, переводящую первое слово во
второе. Все буквы в слове различные.

Длина анаграммы ≤ 10000.

*Формат входных данных.* Пара слов, являющихся анаграммой.

*Формат выходных данных.* YES, если последовательность стековых
операций существует и NO в противном случае.

  in         | out
  -----------|-----
  STOL SLOT  | YES
  ABC CAB    | NO

****************************************************************************/

#include <iostream>

int main()
{
    return 0;
}

