/****************************************************************************
Задача 1_5.

Вывести квадраты натуральных чисел от 1 до n, используя только
O(n) операций сложения и вычитания (умножением пользоваться нельзя).
n ≤ 1000.

  in  | out
  ----| -------------
  5   | 1 4 9 16 25
****************************************************************************/

#include <iostream>


int main()
{
    int n;
    std::cin >> n;
    int p = 1, c = 3;

    for ( int i = 1; i <=n; ++i )
    {
            std::cout << p << ' ';
            p += c;
            c += 2;
    }
    return 0;
}


